grevaillot/svd_tools/headers/STM32F469/otg_fs_host.h
/** @defgroup otg_fs_host_fs_hcfg FSHCFG OTG_FS host configuration register (OTG_FS_HCFG)
@{*/

/** OTG_FS_HOST_FS_HCFG_FSLSS FS- and LS-only support **/
#define OTG_FS_HOST_FS_HCFG_FSLSS		(1 << 2)

#define OTG_FS_HOST_FS_HCFG_FSLSPCS_SHIFT		0
#define OTG_FS_HOST_FS_HCFG_FSLSPCS_MASK		0x03
/** @defgroup otg_fs_host_fs_hcfg_fslspcs FSLSPCS FS/LS PHY clock select
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_hfir HFIR OTG_FS Host frame interval register
@{*/


#define OTG_FS_HOST_HFIR_FRIVL_SHIFT		0
#define OTG_FS_HOST_HFIR_FRIVL_MASK		0xffff
/** @defgroup otg_fs_host_hfir_frivl FRIVL Frame interval
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_fs_hfnum FSHFNUM OTG_FS host frame number/frame time remaining register (OTG_FS_HFNUM)
@{*/


#define OTG_FS_HOST_FS_HFNUM_FTREM_SHIFT		16
#define OTG_FS_HOST_FS_HFNUM_FTREM_MASK		0xffff
/** @defgroup otg_fs_host_fs_hfnum_ftrem FTREM Frame time remaining
@{*/
/**@}*/


#define OTG_FS_HOST_FS_HFNUM_FRNUM_SHIFT		0
#define OTG_FS_HOST_FS_HFNUM_FRNUM_MASK		0xffff
/** @defgroup otg_fs_host_fs_hfnum_frnum FRNUM Frame number
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_fs_hptxsts FSHPTXSTS OTG_FS_Host periodic transmit FIFO/queue status register (OTG_FS_HPTXSTS)
@{*/


#define OTG_FS_HOST_FS_HPTXSTS_PTXQTOP_SHIFT		24
#define OTG_FS_HOST_FS_HPTXSTS_PTXQTOP_MASK		0xff
/** @defgroup otg_fs_host_fs_hptxsts_ptxqtop PTXQTOP Top of the periodic transmit request queue
@{*/
/**@}*/


#define OTG_FS_HOST_FS_HPTXSTS_PTXQSAV_SHIFT		16
#define OTG_FS_HOST_FS_HPTXSTS_PTXQSAV_MASK		0xff
/** @defgroup otg_fs_host_fs_hptxsts_ptxqsav PTXQSAV Periodic transmit request queue space available
@{*/
/**@}*/


#define OTG_FS_HOST_FS_HPTXSTS_PTXFSAVL_SHIFT		0
#define OTG_FS_HOST_FS_HPTXSTS_PTXFSAVL_MASK		0xffff
/** @defgroup otg_fs_host_fs_hptxsts_ptxfsavl PTXFSAVL Periodic transmit data FIFO space available
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_haint HAINT OTG_FS Host all channels interrupt register
@{*/


#define OTG_FS_HOST_HAINT_HAINT_SHIFT		0
#define OTG_FS_HOST_HAINT_HAINT_MASK		0xffff
/** @defgroup otg_fs_host_haint_haint HAINT Channel interrupts
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_haintmsk HAINTMSK OTG_FS host all channels interrupt mask register
@{*/


#define OTG_FS_HOST_HAINTMSK_HAINTM_SHIFT		0
#define OTG_FS_HOST_HAINTMSK_HAINTM_MASK		0xffff
/** @defgroup otg_fs_host_haintmsk_haintm HAINTM Channel interrupt mask
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_fs_hprt FSHPRT OTG_FS host port control and status register (OTG_FS_HPRT)
@{*/


#define OTG_FS_HOST_FS_HPRT_PSPD_SHIFT		17
#define OTG_FS_HOST_FS_HPRT_PSPD_MASK		0x03
/** @defgroup otg_fs_host_fs_hprt_pspd PSPD Port speed
@{*/
/**@}*/


#define OTG_FS_HOST_FS_HPRT_PTCTL_SHIFT		13
#define OTG_FS_HOST_FS_HPRT_PTCTL_MASK		0x0f
/** @defgroup otg_fs_host_fs_hprt_ptctl PTCTL Port test control
@{*/
/**@}*/

/** OTG_FS_HOST_FS_HPRT_PPWR Port power **/
#define OTG_FS_HOST_FS_HPRT_PPWR		(1 << 12)

#define OTG_FS_HOST_FS_HPRT_PLSTS_SHIFT		10
#define OTG_FS_HOST_FS_HPRT_PLSTS_MASK		0x03
/** @defgroup otg_fs_host_fs_hprt_plsts PLSTS Port line status
@{*/
/**@}*/

/** OTG_FS_HOST_FS_HPRT_PRST Port reset **/
#define OTG_FS_HOST_FS_HPRT_PRST		(1 << 8)
/** OTG_FS_HOST_FS_HPRT_PSUSP Port suspend **/
#define OTG_FS_HOST_FS_HPRT_PSUSP		(1 << 7)
/** OTG_FS_HOST_FS_HPRT_PRES Port resume **/
#define OTG_FS_HOST_FS_HPRT_PRES		(1 << 6)
/** OTG_FS_HOST_FS_HPRT_POCCHNG Port overcurrent change **/
#define OTG_FS_HOST_FS_HPRT_POCCHNG		(1 << 5)
/** OTG_FS_HOST_FS_HPRT_POCA Port overcurrent active **/
#define OTG_FS_HOST_FS_HPRT_POCA		(1 << 4)
/** OTG_FS_HOST_FS_HPRT_PENCHNG Port enable/disable change **/
#define OTG_FS_HOST_FS_HPRT_PENCHNG		(1 << 3)
/** OTG_FS_HOST_FS_HPRT_PENA Port enable **/
#define OTG_FS_HOST_FS_HPRT_PENA		(1 << 2)
/** OTG_FS_HOST_FS_HPRT_PCDET Port connect detected **/
#define OTG_FS_HOST_FS_HPRT_PCDET		(1 << 1)
/** OTG_FS_HOST_FS_HPRT_PCSTS Port connect status **/
#define OTG_FS_HOST_FS_HPRT_PCSTS		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_fs_hcchar0 FSHCCHAR0 OTG_FS host channel-0 characteristics register (OTG_FS_HCCHAR0)
@{*/

/** OTG_FS_HOST_FS_HCCHAR0_CHENA Channel enable **/
#define OTG_FS_HOST_FS_HCCHAR0_CHENA		(1 << 31)
/** OTG_FS_HOST_FS_HCCHAR0_CHDIS Channel disable **/
#define OTG_FS_HOST_FS_HCCHAR0_CHDIS		(1 << 30)
/** OTG_FS_HOST_FS_HCCHAR0_ODDFRM Odd frame **/
#define OTG_FS_HOST_FS_HCCHAR0_ODDFRM		(1 << 29)

#define OTG_FS_HOST_FS_HCCHAR0_DAD_SHIFT		22
#define OTG_FS_HOST_FS_HCCHAR0_DAD_MASK		0x7f
/** @defgroup otg_fs_host_fs_hcchar0_dad DAD Device address
@{*/
/**@}*/


#define OTG_FS_HOST_FS_HCCHAR0_MCNT_SHIFT		20
#define OTG_FS_HOST_FS_HCCHAR0_MCNT_MASK		0x03
/** @defgroup otg_fs_host_fs_hcchar0_mcnt MCNT Multicount
@{*/
/**@}*/


#define OTG_FS_HOST_FS_HCCHAR0_EPTYP_SHIFT		18
#define OTG_FS_HOST_FS_HCCHAR0_EPTYP_MASK		0x03
/** @defgroup otg_fs_host_fs_hcchar0_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_HOST_FS_HCCHAR0_LSDEV Low-speed device **/
#define OTG_FS_HOST_FS_HCCHAR0_LSDEV		(1 << 17)
/** OTG_FS_HOST_FS_HCCHAR0_EPDIR Endpoint direction **/
#define OTG_FS_HOST_FS_HCCHAR0_EPDIR		(1 << 15)

#define OTG_FS_HOST_FS_HCCHAR0_EPNUM_SHIFT		11
#define OTG_FS_HOST_FS_HCCHAR0_EPNUM_MASK		0x0f
/** @defgroup otg_fs_host_fs_hcchar0_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_FS_HOST_FS_HCCHAR0_MPSIZ_SHIFT		0
#define OTG_FS_HOST_FS_HCCHAR0_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_host_fs_hcchar0_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_fs_hcint0 FSHCINT0 OTG_FS host channel-0 interrupt register (OTG_FS_HCINT0)
@{*/

/** OTG_FS_HOST_FS_HCINT0_DTERR Data toggle error **/
#define OTG_FS_HOST_FS_HCINT0_DTERR		(1 << 10)
/** OTG_FS_HOST_FS_HCINT0_FRMOR Frame overrun **/
#define OTG_FS_HOST_FS_HCINT0_FRMOR		(1 << 9)
/** OTG_FS_HOST_FS_HCINT0_BBERR Babble error **/
#define OTG_FS_HOST_FS_HCINT0_BBERR		(1 << 8)
/** OTG_FS_HOST_FS_HCINT0_TXERR Transaction error **/
#define OTG_FS_HOST_FS_HCINT0_TXERR		(1 << 7)
/** OTG_FS_HOST_FS_HCINT0_ACK ACK response received/transmitted interrupt **/
#define OTG_FS_HOST_FS_HCINT0_ACK		(1 << 5)
/** OTG_FS_HOST_FS_HCINT0_NAK NAK response received interrupt **/
#define OTG_FS_HOST_FS_HCINT0_NAK		(1 << 4)
/** OTG_FS_HOST_FS_HCINT0_STALL STALL response received interrupt **/
#define OTG_FS_HOST_FS_HCINT0_STALL		(1 << 3)
/** OTG_FS_HOST_FS_HCINT0_CHH Channel halted **/
#define OTG_FS_HOST_FS_HCINT0_CHH		(1 << 1)
/** OTG_FS_HOST_FS_HCINT0_XFRC Transfer completed **/
#define OTG_FS_HOST_FS_HCINT0_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_fs_hcintmsk0 FSHCINTMSK0 OTG_FS host channel-0 mask register (OTG_FS_HCINTMSK0)
@{*/

