grevaillot/svd_tools/headers/STM32F469/otg_fs_host.h
#define OTG_FS_HOST_FS_HCTSIZ1_XFRSIZ_SHIFT		0
#define OTG_FS_HOST_FS_HCTSIZ1_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_host_fs_hctsiz1_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_fs_hcchar2 FSHCCHAR2 OTG_FS host channel-2 characteristics register (OTG_FS_HCCHAR2)
@{*/

/** OTG_FS_HOST_FS_HCCHAR2_CHENA Channel enable **/
#define OTG_FS_HOST_FS_HCCHAR2_CHENA		(1 << 31)
/** OTG_FS_HOST_FS_HCCHAR2_CHDIS Channel disable **/
#define OTG_FS_HOST_FS_HCCHAR2_CHDIS		(1 << 30)
/** OTG_FS_HOST_FS_HCCHAR2_ODDFRM Odd frame **/
#define OTG_FS_HOST_FS_HCCHAR2_ODDFRM		(1 << 29)

#define OTG_FS_HOST_FS_HCCHAR2_DAD_SHIFT		22
#define OTG_FS_HOST_FS_HCCHAR2_DAD_MASK		0x7f
/** @defgroup otg_fs_host_fs_hcchar2_dad DAD Device address
@{*/
/**@}*/


#define OTG_FS_HOST_FS_HCCHAR2_MCNT_SHIFT		20
#define OTG_FS_HOST_FS_HCCHAR2_MCNT_MASK		0x03
/** @defgroup otg_fs_host_fs_hcchar2_mcnt MCNT Multicount
@{*/
/**@}*/


#define OTG_FS_HOST_FS_HCCHAR2_EPTYP_SHIFT		18
#define OTG_FS_HOST_FS_HCCHAR2_EPTYP_MASK		0x03
/** @defgroup otg_fs_host_fs_hcchar2_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_HOST_FS_HCCHAR2_LSDEV Low-speed device **/
#define OTG_FS_HOST_FS_HCCHAR2_LSDEV		(1 << 17)
/** OTG_FS_HOST_FS_HCCHAR2_EPDIR Endpoint direction **/
#define OTG_FS_HOST_FS_HCCHAR2_EPDIR		(1 << 15)

#define OTG_FS_HOST_FS_HCCHAR2_EPNUM_SHIFT		11
#define OTG_FS_HOST_FS_HCCHAR2_EPNUM_MASK		0x0f
/** @defgroup otg_fs_host_fs_hcchar2_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_FS_HOST_FS_HCCHAR2_MPSIZ_SHIFT		0
#define OTG_FS_HOST_FS_HCCHAR2_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_host_fs_hcchar2_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_fs_hcint2 FSHCINT2 OTG_FS host channel-2 interrupt register (OTG_FS_HCINT2)
@{*/

/** OTG_FS_HOST_FS_HCINT2_DTERR Data toggle error **/
#define OTG_FS_HOST_FS_HCINT2_DTERR		(1 << 10)
/** OTG_FS_HOST_FS_HCINT2_FRMOR Frame overrun **/
#define OTG_FS_HOST_FS_HCINT2_FRMOR		(1 << 9)
/** OTG_FS_HOST_FS_HCINT2_BBERR Babble error **/
#define OTG_FS_HOST_FS_HCINT2_BBERR		(1 << 8)
/** OTG_FS_HOST_FS_HCINT2_TXERR Transaction error **/
#define OTG_FS_HOST_FS_HCINT2_TXERR		(1 << 7)
/** OTG_FS_HOST_FS_HCINT2_ACK ACK response received/transmitted interrupt **/
#define OTG_FS_HOST_FS_HCINT2_ACK		(1 << 5)
/** OTG_FS_HOST_FS_HCINT2_NAK NAK response received interrupt **/
#define OTG_FS_HOST_FS_HCINT2_NAK		(1 << 4)
/** OTG_FS_HOST_FS_HCINT2_STALL STALL response received interrupt **/
#define OTG_FS_HOST_FS_HCINT2_STALL		(1 << 3)
/** OTG_FS_HOST_FS_HCINT2_CHH Channel halted **/
#define OTG_FS_HOST_FS_HCINT2_CHH		(1 << 1)
/** OTG_FS_HOST_FS_HCINT2_XFRC Transfer completed **/
#define OTG_FS_HOST_FS_HCINT2_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_fs_hcintmsk2 FSHCINTMSK2 OTG_FS host channel-2 mask register (OTG_FS_HCINTMSK2)
@{*/

/** OTG_FS_HOST_FS_HCINTMSK2_DTERRM Data toggle error mask **/
#define OTG_FS_HOST_FS_HCINTMSK2_DTERRM		(1 << 10)
/** OTG_FS_HOST_FS_HCINTMSK2_FRMORM Frame overrun mask **/
#define OTG_FS_HOST_FS_HCINTMSK2_FRMORM		(1 << 9)
/** OTG_FS_HOST_FS_HCINTMSK2_BBERRM Babble error mask **/
#define OTG_FS_HOST_FS_HCINTMSK2_BBERRM		(1 << 8)
/** OTG_FS_HOST_FS_HCINTMSK2_TXERRM Transaction error mask **/
#define OTG_FS_HOST_FS_HCINTMSK2_TXERRM		(1 << 7)
/** OTG_FS_HOST_FS_HCINTMSK2_NYET response received interrupt mask **/
#define OTG_FS_HOST_FS_HCINTMSK2_NYET		(1 << 6)
/** OTG_FS_HOST_FS_HCINTMSK2_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_FS_HOST_FS_HCINTMSK2_ACKM		(1 << 5)
/** OTG_FS_HOST_FS_HCINTMSK2_NAKM NAK response received interrupt mask **/
#define OTG_FS_HOST_FS_HCINTMSK2_NAKM		(1 << 4)
/** OTG_FS_HOST_FS_HCINTMSK2_STALLM STALL response received interrupt mask **/
#define OTG_FS_HOST_FS_HCINTMSK2_STALLM		(1 << 3)
/** OTG_FS_HOST_FS_HCINTMSK2_CHHM Channel halted mask **/
#define OTG_FS_HOST_FS_HCINTMSK2_CHHM		(1 << 1)
/** OTG_FS_HOST_FS_HCINTMSK2_XFRCM Transfer completed mask **/
#define OTG_FS_HOST_FS_HCINTMSK2_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_fs_hctsiz2 FSHCTSIZ2 OTG_FS host channel-2 transfer size register
@{*/


#define OTG_FS_HOST_FS_HCTSIZ2_DPID_SHIFT		29
#define OTG_FS_HOST_FS_HCTSIZ2_DPID_MASK		0x03
/** @defgroup otg_fs_host_fs_hctsiz2_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_FS_HOST_FS_HCTSIZ2_PKTCNT_SHIFT		19
#define OTG_FS_HOST_FS_HCTSIZ2_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_host_fs_hctsiz2_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_HOST_FS_HCTSIZ2_XFRSIZ_SHIFT		0
#define OTG_FS_HOST_FS_HCTSIZ2_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_host_fs_hctsiz2_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_fs_hcchar3 FSHCCHAR3 OTG_FS host channel-3 characteristics register (OTG_FS_HCCHAR3)
@{*/

/** OTG_FS_HOST_FS_HCCHAR3_CHENA Channel enable **/
#define OTG_FS_HOST_FS_HCCHAR3_CHENA		(1 << 31)
/** OTG_FS_HOST_FS_HCCHAR3_CHDIS Channel disable **/
#define OTG_FS_HOST_FS_HCCHAR3_CHDIS		(1 << 30)
/** OTG_FS_HOST_FS_HCCHAR3_ODDFRM Odd frame **/
#define OTG_FS_HOST_FS_HCCHAR3_ODDFRM		(1 << 29)

#define OTG_FS_HOST_FS_HCCHAR3_DAD_SHIFT		22
#define OTG_FS_HOST_FS_HCCHAR3_DAD_MASK		0x7f
/** @defgroup otg_fs_host_fs_hcchar3_dad DAD Device address
@{*/
/**@}*/


#define OTG_FS_HOST_FS_HCCHAR3_MCNT_SHIFT		20
#define OTG_FS_HOST_FS_HCCHAR3_MCNT_MASK		0x03
/** @defgroup otg_fs_host_fs_hcchar3_mcnt MCNT Multicount
@{*/
/**@}*/


#define OTG_FS_HOST_FS_HCCHAR3_EPTYP_SHIFT		18
#define OTG_FS_HOST_FS_HCCHAR3_EPTYP_MASK		0x03
/** @defgroup otg_fs_host_fs_hcchar3_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_HOST_FS_HCCHAR3_LSDEV Low-speed device **/
#define OTG_FS_HOST_FS_HCCHAR3_LSDEV		(1 << 17)
/** OTG_FS_HOST_FS_HCCHAR3_EPDIR Endpoint direction **/
#define OTG_FS_HOST_FS_HCCHAR3_EPDIR		(1 << 15)

#define OTG_FS_HOST_FS_HCCHAR3_EPNUM_SHIFT		11
#define OTG_FS_HOST_FS_HCCHAR3_EPNUM_MASK		0x0f
/** @defgroup otg_fs_host_fs_hcchar3_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_FS_HOST_FS_HCCHAR3_MPSIZ_SHIFT		0
#define OTG_FS_HOST_FS_HCCHAR3_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_host_fs_hcchar3_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_fs_hcint3 FSHCINT3 OTG_FS host channel-3 interrupt register (OTG_FS_HCINT3)
@{*/

/** OTG_FS_HOST_FS_HCINT3_DTERR Data toggle error **/
#define OTG_FS_HOST_FS_HCINT3_DTERR		(1 << 10)
/** OTG_FS_HOST_FS_HCINT3_FRMOR Frame overrun **/
#define OTG_FS_HOST_FS_HCINT3_FRMOR		(1 << 9)
/** OTG_FS_HOST_FS_HCINT3_BBERR Babble error **/
#define OTG_FS_HOST_FS_HCINT3_BBERR		(1 << 8)
/** OTG_FS_HOST_FS_HCINT3_TXERR Transaction error **/
#define OTG_FS_HOST_FS_HCINT3_TXERR		(1 << 7)
/** OTG_FS_HOST_FS_HCINT3_ACK ACK response received/transmitted interrupt **/
#define OTG_FS_HOST_FS_HCINT3_ACK		(1 << 5)
/** OTG_FS_HOST_FS_HCINT3_NAK NAK response received interrupt **/
#define OTG_FS_HOST_FS_HCINT3_NAK		(1 << 4)
/** OTG_FS_HOST_FS_HCINT3_STALL STALL response received interrupt **/
#define OTG_FS_HOST_FS_HCINT3_STALL		(1 << 3)
/** OTG_FS_HOST_FS_HCINT3_CHH Channel halted **/
#define OTG_FS_HOST_FS_HCINT3_CHH		(1 << 1)
/** OTG_FS_HOST_FS_HCINT3_XFRC Transfer completed **/
#define OTG_FS_HOST_FS_HCINT3_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_fs_hcintmsk3 FSHCINTMSK3 OTG_FS host channel-3 mask register (OTG_FS_HCINTMSK3)
@{*/

/** OTG_FS_HOST_FS_HCINTMSK3_DTERRM Data toggle error mask **/
#define OTG_FS_HOST_FS_HCINTMSK3_DTERRM		(1 << 10)
/** OTG_FS_HOST_FS_HCINTMSK3_FRMORM Frame overrun mask **/
#define OTG_FS_HOST_FS_HCINTMSK3_FRMORM		(1 << 9)
/** OTG_FS_HOST_FS_HCINTMSK3_BBERRM Babble error mask **/
#define OTG_FS_HOST_FS_HCINTMSK3_BBERRM		(1 << 8)
/** OTG_FS_HOST_FS_HCINTMSK3_TXERRM Transaction error mask **/
#define OTG_FS_HOST_FS_HCINTMSK3_TXERRM		(1 << 7)
/** OTG_FS_HOST_FS_HCINTMSK3_NYET response received interrupt mask **/
#define OTG_FS_HOST_FS_HCINTMSK3_NYET		(1 << 6)
/** OTG_FS_HOST_FS_HCINTMSK3_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_FS_HOST_FS_HCINTMSK3_ACKM		(1 << 5)
/** OTG_FS_HOST_FS_HCINTMSK3_NAKM NAK response received interrupt mask **/
#define OTG_FS_HOST_FS_HCINTMSK3_NAKM		(1 << 4)
/** OTG_FS_HOST_FS_HCINTMSK3_STALLM STALL response received interrupt mask **/
#define OTG_FS_HOST_FS_HCINTMSK3_STALLM		(1 << 3)
/** OTG_FS_HOST_FS_HCINTMSK3_CHHM Channel halted mask **/
#define OTG_FS_HOST_FS_HCINTMSK3_CHHM		(1 << 1)
/** OTG_FS_HOST_FS_HCINTMSK3_XFRCM Transfer completed mask **/
#define OTG_FS_HOST_FS_HCINTMSK3_XFRCM		(1 << 0)

/**@}*/

